---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.TextureLinkTextureTransforms
source: html/2bb5bc1b-094f-d31b-163b-b51386c56048.htm
---
# Autodesk.Revit.DB.Visual.Noise.TextureLinkTextureTransforms Property

The property labeled "Link Transforms" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string TextureLinkTextureTransforms { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".